{
    "OptML": {
        "image": "proj_1.png",
        "number": "P-01",
        "topics": "Enhancing structural optimization with tailored neural network models.",
        "description_short": "Enhancing structural optimization with tailored neural network models.",
        "description": "The project on topological optimization using neural networks focuses on developing and enhancing machine learning models to address complex challenges in the field of structural optimization. Across several monthly reports, significant progress has been made, tackling key issues such as overfitting in neural network results and the need for greater diversity in the training dataset. Various neural network architectures have been explored, including U-Net and Vision Transformer (ViT), specifically tailored to address the unique challenges of topological optimization. Additionally, research has been conducted into hyperparameter automation to further improve the models’ generalization capability. Through dataset expansion and the implementation of new architectures, the project aims to provide more accurate and applicable results across a wide range of scenarios, laying the groundwork for future research and advancements in the field of topological optimization through machine learning"
    },
    "Ingest App": {
        "image": "proj_2.png",
        "number": "P-02",
        "topics": "Machine Learning, Backend Development, Database Management",
        "description_short": "Mobile app for instant nutritional analysis using AI.",
        "description": "The Ingest App is a groundbreaking mobile application available for both iOS and Android devices, designed to transform how users interact with their food. Leveraging advanced machine learning models, the Ingest App allows users to simply take a photo of their meal. Instantly, the app analyzes the image and provides detailed nutritional data. This innovative technology not only identifies the components of the food but also offers comprehensive insights into calories, macros, and micronutrients. Our intelligent ML-driven platform empowers users to make informed dietary decisions based on accurate, real-time nutritional information. The app's intuitive interface and robust database ensure a seamless user experience, catering to health enthusiasts, individuals managing dietary conditions, and anyone curious about their food intake. As we continuously improve the Ingest App, we focus on enhancing the accuracy of our models through extensive training with diverse food datasets. Our commitment to leveraging the latest advancements in artificial intelligence ensures that the Ingest App remains at the forefront of nutritional technology, helping users achieve their health and wellness goals with confidence and ease."
    },
    "Solar Tracking": {
        "image": "proj_3.png",
        "number": "P-03",
        "topics": "Computational Mechanics, Solar Energy, Mechanical Engineering",
        "description_short": "Optimizing solar tracking at EAFIT with advanced engineering solutions.",
        "description": "The Solar Tracking Station project at EAFIT University represents a significant leap forward in solar technology optimization. As a member of the project team, I contributed to various critical aspects of the station's development, utilizing SolidWorks for parts design and engaging in finite element method (FEM) analysis to ensure structural integrity and efficiency. Our goal was to optimize the solar tracking mechanism, which involved a detailed study of the state of the art in supplier technologies and the strategic use of a linear actuator. By meticulously analyzing and selecting the optimal assembly points for the actuator, we achieved a highly efficient tracking system that operates with minimized energy consumption. This optimization process not only enhanced the operational effectiveness of the solar tracker but also extended its longevity and reduced maintenance needs. The project's success is marked by its innovative approach to maximizing solar energy capture through precise movement and positioning of the solar panels. This initiative not only supports sustainable energy efforts but also serves as a benchmark for future advancements in solar tracking technologies. The collaborative efforts and findings from this project continue to influence ongoing research and development in renewable energy systems, underpinning EAFIT University's commitment to pioneering engineering solutions."
    }
}